docs/type_checking.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-Jan-27 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Boba Devlog #1: Sliding in a Type Checker</title>
<meta name="author" content="Veera Sivarajan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./css/style.css"/>
</head>
<body>
<header id="top" class="status">
<nav>
  <a href="https://github.com/veera-sivarajan">GitHub</a>
  <a href="/">Home</a>
  <a href="/about/">About</a>
  <a href="mailto:sveera.2001@gmail.com">Email</a>
</nav>  
</header>
<main id="content" class="content">
<header>
<h1 class="title">Boba Devlog #1: Sliding in a Type Checker</h1>
<p class="subtitle" role="doc-subtitle">2023-Jul-31</p>
</header><p>
<a href="https://github.com/veera-sivarajan/boba/tree/main">Boba</a> is a compiler project I&rsquo;m working on to learn how to implement type system, code optimization passes and code generation. It compiles a language with Rust-like syntax and C-like semantics to x86-64 assembly. Check out the <a href="https://github.com/veera-sivarajan/boba/blob/main/language.org">language documentation</a> to know more about syntax and semantics of the language.
</p>

<p>
This month I implemented a type checker and it helped me to make a number of improvements to the language. Now, the compiler can handle more primitive data types and also a Rust style format string for print statements. In this post, I will explain everything I learnt over the month.
</p>
<section id="outline-container-orga29aa19" class="outline-2">
<h2 id="orga29aa19"><span class="section-number-2">1.</span> Learning x86-64 Assembly</h2>
<div class="outline-text-2" id="text-1">
<p>
Before starting this project, I did not know anything about assembly. So, to learn how various language constructs can be expressed in assembly, I&rsquo;d write a simple C program and compile it using <code>gcc -O0 -fverbose-asm -S</code>. The assembly file produced by this command shows each line of the source code (in comments) and its equivalent unoptimized assembly right below it. This helped me a lot to understand how function call and stack alignment work at the assembly level.
</p>
</div>
</section>
<section id="outline-container-orgfe01b4f" class="outline-2">
<h2 id="orgfe01b4f"><span class="section-number-2">2.</span> Type Checking</h2>
<div class="outline-text-2" id="text-2">
<p>
Initially, I thought I should implement Hindley-Milner type inference algorithm to infer the types of all expressions because the language is implicitly typed. But, after reading a <a href="https://lobste.rs/s/ewxw1i/less_technical_introductions_type#c_hotmwn">comment</a> by matklad, I realized I don&rsquo;t need that since there are no generics in my language. 
</p>

<p>
Therefore, my current implementation walks through every node in the AST like a tree-walk interpreter but instead of evaluating primary expressions to their values, it evaluates them to their types. For example, the expression <code>Expr::Number(23)</code> evaluates to <code>Type::Number</code>. The types are then bubbled-up the AST and checked if they are equal to the expected type. If a type does not match the expected type, an appropriate error is added to a list and type checker continues to check the rest of the program. After the whole program is analyzed, the compiler prints out all the errors in the list. If there is no error, the AST along with all the type information is passed on to the code generator to generate the assembly. The code generator will use the type information of each expression to choose the correct instruction suffix and register size. As an example, the code generator will choose <code>movl</code> and <code>%eax</code> for returning a 32 bit number type instead of <code>movq</code> and <code>%rax</code>.
</p>
</div>
</section>
<section id="outline-container-org9f81221" class="outline-2">
<h2 id="org9f81221"><span class="section-number-2">3.</span> Fancy Print Statement</h2>
<div class="outline-text-2" id="text-3">
<p>
Additionally, implementing a type checker paved way for Rust style fancy format strings in print statements even though the compiler calls <code>printf()</code> to display values to <code>stdout</code>.
</p>
<div class="org-src-container">
<pre class="src src-rust">println("{}. Your name is: {}", some_number, some_string);
</pre>
</div>
<p>
Since the compiler can infer the types of both <code>some_number</code> and <code>some_string</code>, the format string is replaced with appropriate C format specifiers and compiled to <code>"%d. Your name is: %s\n"</code> before being passed as first argument to <code>printf()</code>. Finally, the values to be printed get passed as subsequent arguments to <code>printf()</code> without any changes because the primitive types in my language are compatible with C ABI.
</p>
</div>
</section>
<section id="outline-container-org4d58f98" class="outline-2">
<h2 id="org4d58f98"><span class="section-number-2">4.</span> Fixing Stack Alignment</h2>
<div class="outline-text-2" id="text-4">
<p>
I first encountered this bug when calling <code>printf()</code>. The program would abruptly crash when a function has a certain number of local variables and it was very confusing because there wasn&rsquo;t anything wrong in the generated assembly in terms of space allocated on the stack or using the correct instructions.
</p>

<p>
Turns out the System V ABI requires the stack to be aligned to a 16 byte boundary inside every function. So my mistake was allocating the exact amount of space required for local variables as a function with three boolean values will allocate three bytes plus forty eight bytes for callee saved registers and leave the stack misaligned. To fix this, the code generator rounds the sum of space required for local variables and callee saved registers to the nearest multiple of 16 before allocating. In the function epilogue, the rounded up amount of space gets deallocated from the stack.
</p>

<p>
This solved the issue and now the programs don&rsquo;t crash for any number of local variables.
</p>
</div>
</section>
</main>
<footer id="postamble" class="status">
<script id="umaring_js" src="https://umaring.hamy.cc/ring.js?id=veera"></script>
<div id="umaring"></div>
<div class='footer'>
  Last updated on 2024-Jan-27 Sat 11:21. <br>
</div>
</footer>
</body>
</html>
